Revit 2024 API
AddInId Constructor
 creates an AddInId object with a given GUID
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AddInId(
	Guid val
)
Visual Basic
Public Sub New ( _
	val As Guid _
)
Visual C++
public:
AddInId(
	Guid val
)
Parameters
val
Type: System.Guid
 GUID value
See Also
AddInId Class
Autodesk.Revit.DB Namespace